app/controllers/likes_controller.rb

    def index
        render json: Like.all
---
SELECT "likes".* FROM "likes"

    def create
        like = Like.create!(like_params)
---
INSERT INTO "likes" ("user_id", "received_id", "created_at", "updated_at", "match_id") VALUES (?, ?, ?, ?, ?)  [["user_id", 157], ["received_id", 154], ["created_at", "2022-10-26 21:31:12.784363"], ["updated_at", "2022-10-26 21:31:12.784363"], ["match_id", 5]]