app/controllers/matches_controller.rb

    def index
        render json: Match.all
---
SELECT "matches".* FROM "matches"

    def create
        match = Match.create!(match_params)
---
INSERT INTO "matches" ("user1_id", "user2_id", "created_at", "updated_at", "didtheymatch") VALUES (?, ?, ?, ?, ?)  [["user1_id", nil], ["user2_id", nil], ["created_at", "2022-10-26 21:38:47.013671"], ["updated_at", "2022-10-26 21:38:47.013671"], ["didtheymatch", nil]]