app/controllers/profiles_controller.rb

    def index
        render json: Profile.all
---
SELECT "profiles".* FROM "profiles"

    def update
        profile = Profile.find(params[:id])
        profile.update!(profile_params)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "profiles" SET "beard_length" = ?, "truck_brand" = ?, "mode_of_tobacco" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["beard_length", 5], ["truck_brand", "ford"], ["mode_of_tobacco", "wtf"], ["updated_at", "2022-10-27 16:51:59.593084"], ["id", 9]]

    def create
        profile = Profile.create!(profile_params)
---
INSERT INTO "profiles" ("profile_picture", "photo_png", "beard_length", "moonshine_abv_level", "rodeo_buckles", "truck_brand", "mode_of_tobacco", "pontoon_boat?", "security_goat?", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)