app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bobby@gmail.com"], ["LIMIT", 1]]
---
    def create # '/login'

        user = User.find_by(email:params[:email])