app/controllers/skips_controller.rb

SELECT "skips".* FROM "skips"
---
    def index
        render json: Skip.all

INSERT INTO "skips" ("user_id", "rejected_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 12], ["rejected_id", 14], ["created_at", "2022-10-27 16:05:03.891112"], ["updated_at", "2022-10-27 16:05:03.891112"]]
---
    def create
        skip = Skip.create!(skips_params)