app/controllers/users_controller.rb

INSERT INTO "users" ("email", "first_name", "last_name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", "bob@gmail.com"], ["first_name", nil], ["last_name", nil], ["password_digest", "[FILTERED]"], ["created_at", "2022-10-25 16:35:00.761913"], ["updated_at", "2022-10-25 16:35:00.761913"]]
---
    def create
        user = User.create!(user_params)